ranjithaguna/pv/LED_Demo/source/pic32cx/component/vbat.h
/**
 * \brief Component description for PIC32CX/0525SG12 VBAT
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_VBAT_COMPONENT_H_
#define _PIC32CX_0525SG12_VBAT_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_VBAT The VBAT Register Bank block is a block implemented for aggregating miscellaneous\n        battery-backed registers required the host and by the Embedded Controller (EC) Subsystem that are\n        not unique to a block implemented in the EC subsystem.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR VBAT */
/* ========================================================================== */

/* -------- VBAT_PFR_STS : (VBAT Offset: 0x00) (R/W 8) The Power-Fail and Reset Status Register collects and retains the VBAT RST and WDT event status when VCC1 is unpowered. -------- */

typedef union
{
  struct
  {
    uint8_t  :2;                        /**< bit:   0..1  Reserved                                      */
    uint8_t  SOFT:1;                    /**< bit:      2  This bit is set to '1b' if a was triggered by an assertion of the SOFT_SYS_RESET bit in the System Reset Register.\n      This bit is cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC) */
    uint8_t  TEST:1;                    /**< bit:      3  Test                                          */
    uint8_t  RESETI:1;                  /**< bit:      4  This bit is set to '1b' if a RESET_SYS was triggered by a low signal on the RESETI# input pin. This bit is\n      cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC) */
    uint8_t  WDT_EVT:1;                 /**< bit:      5  This bit is set to '1b' if a RESET_SYS was triggered by a Watchdog Timer event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC) */
    uint8_t  SYSRESETREQ:1;             /**< bit:      6  This bit is set to '1b' if a RESET_SYS was triggered by an ARM SYSRESETREQ event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC) */
    uint8_t  VBAT_RST:1;                /**< bit:      7  The VBAT RST bit is set to '1' by hardware when a RESET_VBAT is detected. This is the register default value.\n      To clear VBAT RST EC firmware must write a '1' to this bit; writing a '0' to VBAT RST has no affect.(R/WC) */
  };
  uint8_t  w;
} __VBAT_PFR_STS_bits_t;
#define VBAT_PFR_STS_RESETVALUE             (0x80U)                                       /**<  (VBAT_PFR_STS) The Power-Fail and Reset Status Register collects and retains the VBAT RST and WDT event status when VCC1 is unpowered.  Reset Value */

#define VBAT_PFR_STS_SOFT_Pos                 (2)                                            /**< (VBAT_PFR_STS) This bit is set to '1b' if a was triggered by an assertion of the SOFT_SYS_RESET bit in the System Reset Register.\n      This bit is cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC) Position */
#define VBAT_PFR_STS_SOFT_Msk                 (0x1U << VBAT_PFR_STS_SOFT_Pos)                /**< (VBAT_PFR_STS) This bit is set to '1b' if a was triggered by an assertion of the SOFT_SYS_RESET bit in the System Reset Register.\n      This bit is cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC) Mask */
#define VBAT_PFR_STS_TEST_Pos                 (3)                                            /**< (VBAT_PFR_STS) Test Position */
#define VBAT_PFR_STS_TEST_Msk                 (0x1U << VBAT_PFR_STS_TEST_Pos)                /**< (VBAT_PFR_STS) Test Mask */
#define VBAT_PFR_STS_RESETI_Pos               (4)                                            /**< (VBAT_PFR_STS) This bit is set to '1b' if a RESET_SYS was triggered by a low signal on the RESETI# input pin. This bit is\n      cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC) Position */
#define VBAT_PFR_STS_RESETI_Msk               (0x1U << VBAT_PFR_STS_RESETI_Pos)              /**< (VBAT_PFR_STS) This bit is set to '1b' if a RESET_SYS was triggered by a low signal on the RESETI# input pin. This bit is\n      cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC) Mask */
#define VBAT_PFR_STS_WDT_EVT_Pos              (5)                                            /**< (VBAT_PFR_STS) This bit is set to '1b' if a RESET_SYS was triggered by a Watchdog Timer event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC) Position */
#define VBAT_PFR_STS_WDT_EVT_Msk              (0x1U << VBAT_PFR_STS_WDT_EVT_Pos)             /**< (VBAT_PFR_STS) This bit is set to '1b' if a RESET_SYS was triggered by a Watchdog Timer event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC) Mask */
#define VBAT_PFR_STS_SYSRESETREQ_Pos          (6)                                            /**< (VBAT_PFR_STS) This bit is set to '1b' if a RESET_SYS was triggered by an ARM SYSRESETREQ event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC) Position */
#define VBAT_PFR_STS_SYSRESETREQ_Msk          (0x1U << VBAT_PFR_STS_SYSRESETREQ_Pos)         /**< (VBAT_PFR_STS) This bit is set to '1b' if a RESET_SYS was triggered by an ARM SYSRESETREQ event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC) Mask */
#define VBAT_PFR_STS_VBAT_RST_Pos             (7)                                            /**< (VBAT_PFR_STS) The VBAT RST bit is set to '1' by hardware when a RESET_VBAT is detected. This is the register default value.\n      To clear VBAT RST EC firmware must write a '1' to this bit; writing a '0' to VBAT RST has no affect.(R/WC) Position */
#define VBAT_PFR_STS_VBAT_RST_Msk             (0x1U << VBAT_PFR_STS_VBAT_RST_Pos)            /**< (VBAT_PFR_STS) The VBAT RST bit is set to '1' by hardware when a RESET_VBAT is detected. This is the register default value.\n      To clear VBAT RST EC firmware must write a '1' to this bit; writing a '0' to VBAT RST has no affect.(R/WC) Mask */
#define VBAT_PFR_STS_Msk                      (0x000000FCUL)                                 /**< (VBAT_PFR_STS) Register Mask  */

/* -------- VBAT_CLOCK_EN : (VBAT Offset: 0x08) (R/W 32) CLOCK ENABLE -------- */

typedef union
{
  struct
  {
    uint32_t C32K_SUPPRESS:1;           /**< bit:      0  1=32KHz clock domain is off while VTR is off (i.e., while on VBAT only). The 32KHz domain is always on\n      while VTR is on, so the PLL always has a reference.\n      0=32KHz clock domain is enabled while VTR is off (i.e., while on VBAT only). The clock source for the 32KHz domain is\n      determined by the other bits in this register */
    uint32_t EXT_32K:1;                 /**< bit:      1  This bit selects the source for the 32KHz clock domain.\n      1=The 32KHZ_IN VTR-powered pin is used as a source for the 32KHz clock domain. If an activity detector does not detect a\n      clock on the selected source, the always-on 32KHz internal clock source is automatically selected\n      0=The always-on32Khz clock source is used as the source for the 32KHz clock domain. */
    uint32_t C32KHZ_SOURCE:1;           /**< bit:      2  This field determines the source for the always-on 32KHz internal clock source. If set to '1b', this bit\n      will only take effect if an active clock has been detected on the crystal pins. Once the 32KHz source has been switched,\n      activity detection on the crystal no longer functions. Therefore, if the crystal oscillator uses a single-ended\n      input, once started that input must not stop while this bit is '1b'.\n      1=Crystal Oscillator. The selection between a singled-ended input or a resonant crystal is determined by XOSEL in this register\n      0=Silicon Oscillator. */
    uint32_t XOSEL:1;                   /**< bit:      3  This bit selects between a single-ended clock source for the crystal oscillator or an external parallel crystal.\n                1= the Crystal Oscillator is driven by a single-ended 32KHz clock source connected to the XTAL2 pin. \n                0= the Crystal Oscillator requires a 32KHz parallel resonant crystal connected between the XTAL1 and XTAL2 pins (default). */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __VBAT_CLOCK_EN_bits_t;
#define VBAT_CLOCK_EN_RESETVALUE            (0x00U)                                       /**<  (VBAT_CLOCK_EN) CLOCK ENABLE  Reset Value */

