ranjithaguna/pv/LED_Demo/source/pic32cx/component/vbat.h
#define VBAT_CLOCK_EN_C32K_SUPPRESS_Pos       (0)                                            /**< (VBAT_CLOCK_EN) 1=32KHz clock domain is off while VTR is off (i.e., while on VBAT only). The 32KHz domain is always on\n      while VTR is on, so the PLL always has a reference.\n      0=32KHz clock domain is enabled while VTR is off (i.e., while on VBAT only). The clock source for the 32KHz domain is\n      determined by the other bits in this register Position */
#define VBAT_CLOCK_EN_C32K_SUPPRESS_Msk       (0x1U << VBAT_CLOCK_EN_C32K_SUPPRESS_Pos)      /**< (VBAT_CLOCK_EN) 1=32KHz clock domain is off while VTR is off (i.e., while on VBAT only). The 32KHz domain is always on\n      while VTR is on, so the PLL always has a reference.\n      0=32KHz clock domain is enabled while VTR is off (i.e., while on VBAT only). The clock source for the 32KHz domain is\n      determined by the other bits in this register Mask */
#define VBAT_CLOCK_EN_EXT_32K_Pos             (1)                                            /**< (VBAT_CLOCK_EN) This bit selects the source for the 32KHz clock domain.\n      1=The 32KHZ_IN VTR-powered pin is used as a source for the 32KHz clock domain. If an activity detector does not detect a\n      clock on the selected source, the always-on 32KHz internal clock source is automatically selected\n      0=The always-on32Khz clock source is used as the source for the 32KHz clock domain. Position */
#define VBAT_CLOCK_EN_EXT_32K_Msk             (0x1U << VBAT_CLOCK_EN_EXT_32K_Pos)            /**< (VBAT_CLOCK_EN) This bit selects the source for the 32KHz clock domain.\n      1=The 32KHZ_IN VTR-powered pin is used as a source for the 32KHz clock domain. If an activity detector does not detect a\n      clock on the selected source, the always-on 32KHz internal clock source is automatically selected\n      0=The always-on32Khz clock source is used as the source for the 32KHz clock domain. Mask */
#define VBAT_CLOCK_EN_C32KHZ_SOURCE_Pos       (2)                                            /**< (VBAT_CLOCK_EN) This field determines the source for the always-on 32KHz internal clock source. If set to '1b', this bit\n      will only take effect if an active clock has been detected on the crystal pins. Once the 32KHz source has been switched,\n      activity detection on the crystal no longer functions. Therefore, if the crystal oscillator uses a single-ended\n      input, once started that input must not stop while this bit is '1b'.\n      1=Crystal Oscillator. The selection between a singled-ended input or a resonant crystal is determined by XOSEL in this register\n      0=Silicon Oscillator. Position */
#define VBAT_CLOCK_EN_C32KHZ_SOURCE_Msk       (0x1U << VBAT_CLOCK_EN_C32KHZ_SOURCE_Pos)      /**< (VBAT_CLOCK_EN) This field determines the source for the always-on 32KHz internal clock source. If set to '1b', this bit\n      will only take effect if an active clock has been detected on the crystal pins. Once the 32KHz source has been switched,\n      activity detection on the crystal no longer functions. Therefore, if the crystal oscillator uses a single-ended\n      input, once started that input must not stop while this bit is '1b'.\n      1=Crystal Oscillator. The selection between a singled-ended input or a resonant crystal is determined by XOSEL in this register\n      0=Silicon Oscillator. Mask */
#define VBAT_CLOCK_EN_XOSEL_Pos               (3)                                            /**< (VBAT_CLOCK_EN) This bit selects between a single-ended clock source for the crystal oscillator or an external parallel crystal.\n                1= the Crystal Oscillator is driven by a single-ended 32KHz clock source connected to the XTAL2 pin. \n                0= the Crystal Oscillator requires a 32KHz parallel resonant crystal connected between the XTAL1 and XTAL2 pins (default). Position */
#define VBAT_CLOCK_EN_XOSEL_Msk               (0x1U << VBAT_CLOCK_EN_XOSEL_Pos)              /**< (VBAT_CLOCK_EN) This bit selects between a single-ended clock source for the crystal oscillator or an external parallel crystal.\n                1= the Crystal Oscillator is driven by a single-ended 32KHz clock source connected to the XTAL2 pin. \n                0= the Crystal Oscillator requires a 32KHz parallel resonant crystal connected between the XTAL1 and XTAL2 pins (default). Mask */
#define VBAT_CLOCK_EN_Msk                     (0x0000000FUL)                                 /**< (VBAT_CLOCK_EN) Register Mask  */

/* -------- VBAT_SYS_SHUTDOWN : (VBAT Offset: 0x0c) (R/W 32) System Shutdown Enable register.\n -------- */

typedef union
{
  struct
  {
    uint32_t SYS_SHDN_DIS:1;            /**< bit:      0  This bit controls the System Shutdown.\n         0 = Enable System Shutdown (SYS_SHDN#).\n         1 = Disable System Shutdown (SYS_SHDN#).\n */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __VBAT_SYS_SHUTDOWN_bits_t;
#define VBAT_SYS_SHUTDOWN_RESETVALUE        (0x00U)                                       /**<  (VBAT_SYS_SHUTDOWN) System Shutdown Enable register.\n  Reset Value */

#define VBAT_SYS_SHUTDOWN_SYS_SHDN_DIS_Pos    (0)                                            /**< (VBAT_SYS_SHUTDOWN) This bit controls the System Shutdown.\n         0 = Enable System Shutdown (SYS_SHDN#).\n         1 = Disable System Shutdown (SYS_SHDN#).\n Position */
#define VBAT_SYS_SHUTDOWN_SYS_SHDN_DIS_Msk    (0x1U << VBAT_SYS_SHUTDOWN_SYS_SHDN_DIS_Pos)   /**< (VBAT_SYS_SHUTDOWN) This bit controls the System Shutdown.\n         0 = Enable System Shutdown (SYS_SHDN#).\n         1 = Disable System Shutdown (SYS_SHDN#).\n Mask */
#define VBAT_SYS_SHUTDOWN_Msk                 (0x00000001UL)                                 /**< (VBAT_SYS_SHUTDOWN) Register Mask  */

/* -------- VBAT_MONOTONIC_COUNTER : (VBAT Offset: 0x20) (R/W 32) MONOTONIC COUNTER -------- */

typedef union
{
  struct
  {
    uint32_t MONOTONIC_COUNTER:32;      /**< bit:  0..31  Read-only register that increments by 1 every time it is read. It is reset to 0 on a VBAT Power On Reset. */
  };
  uint32_t w;
} __VBAT_MONOTONIC_COUNTER_bits_t;
#define VBAT_MONOTONIC_COUNTER_RESETVALUE   (0x00U)                                       /**<  (VBAT_MONOTONIC_COUNTER) MONOTONIC COUNTER  Reset Value */

