ranjithaguna/pv/LED_Demo/source/pic32cx/component/vbat.h
#define VBAT_MONOTONIC_COUNTER_MONOTONIC_COUNTER_Pos (0)                                            /**< (VBAT_MONOTONIC_COUNTER) Read-only register that increments by 1 every time it is read. It is reset to 0 on a VBAT Power On Reset. Position */
#define VBAT_MONOTONIC_COUNTER_MONOTONIC_COUNTER_Msk (0xFFFFFFFFU << VBAT_MONOTONIC_COUNTER_MONOTONIC_COUNTER_Pos)  /**< (VBAT_MONOTONIC_COUNTER) Read-only register that increments by 1 every time it is read. It is reset to 0 on a VBAT Power On Reset. Mask */
#define VBAT_MONOTONIC_COUNTER_MONOTONIC_COUNTER(value) (VBAT_MONOTONIC_COUNTER_MONOTONIC_COUNTER_Msk & ((value) << VBAT_MONOTONIC_COUNTER_MONOTONIC_COUNTER_Pos))
#define VBAT_MONOTONIC_COUNTER_Msk            (0xFFFFFFFFUL)                                 /**< (VBAT_MONOTONIC_COUNTER) Register Mask  */

/* -------- VBAT_COUNTER_HIWORD : (VBAT Offset: 0x24) (R/W 32) COUNTER HIWORD -------- */

typedef union
{
  struct
  {
    uint32_t COUNTER_HIWORD:32;         /**< bit:  0..31  Thirty-two bit read/write register. If software sets this register to an incrementing value, based on an external\n      non-volatile store, this register may be combined with the Monotonic Counter Register to form a 64-bit monotonic counter. */
  };
  uint32_t w;
} __VBAT_COUNTER_HIWORD_bits_t;
#define VBAT_COUNTER_HIWORD_RESETVALUE      (0x00U)                                       /**<  (VBAT_COUNTER_HIWORD) COUNTER HIWORD  Reset Value */

#define VBAT_COUNTER_HIWORD_COUNTER_HIWORD_Pos (0)                                            /**< (VBAT_COUNTER_HIWORD) Thirty-two bit read/write register. If software sets this register to an incrementing value, based on an external\n      non-volatile store, this register may be combined with the Monotonic Counter Register to form a 64-bit monotonic counter. Position */
#define VBAT_COUNTER_HIWORD_COUNTER_HIWORD_Msk (0xFFFFFFFFU << VBAT_COUNTER_HIWORD_COUNTER_HIWORD_Pos)  /**< (VBAT_COUNTER_HIWORD) Thirty-two bit read/write register. If software sets this register to an incrementing value, based on an external\n      non-volatile store, this register may be combined with the Monotonic Counter Register to form a 64-bit monotonic counter. Mask */
#define VBAT_COUNTER_HIWORD_COUNTER_HIWORD(value) (VBAT_COUNTER_HIWORD_COUNTER_HIWORD_Msk & ((value) << VBAT_COUNTER_HIWORD_COUNTER_HIWORD_Pos))
#define VBAT_COUNTER_HIWORD_Msk               (0xFFFFFFFFUL)                                 /**< (VBAT_COUNTER_HIWORD) Register Mask  */

/* -------- VBAT_VWIRE_BACKUP : (VBAT Offset: 0x28) (R/W 32) VWIRE_BACKUP -------- */

typedef union
{
  struct
  {
    uint32_t M2S_2H_BACKUP:4;           /**< bit:   0..3  The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 2h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic. */
    uint32_t M2S_42H_BACKUP:4;          /**< bit:   4..7  The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 42h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __VBAT_VWIRE_BACKUP_bits_t;
#define VBAT_VWIRE_BACKUP_RESETVALUE        (0x00U)                                       /**<  (VBAT_VWIRE_BACKUP) VWIRE_BACKUP  Reset Value */

#define VBAT_VWIRE_BACKUP_M2S_2H_BACKUP_Pos   (0)                                            /**< (VBAT_VWIRE_BACKUP) The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 2h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic. Position */
#define VBAT_VWIRE_BACKUP_M2S_2H_BACKUP_Msk   (0xFU << VBAT_VWIRE_BACKUP_M2S_2H_BACKUP_Pos)  /**< (VBAT_VWIRE_BACKUP) The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 2h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic. Mask */
#define VBAT_VWIRE_BACKUP_M2S_2H_BACKUP(value) (VBAT_VWIRE_BACKUP_M2S_2H_BACKUP_Msk & ((value) << VBAT_VWIRE_BACKUP_M2S_2H_BACKUP_Pos))
#define VBAT_VWIRE_BACKUP_M2S_42H_BACKUP_Pos  (4)                                            /**< (VBAT_VWIRE_BACKUP) The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 42h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic. Position */
#define VBAT_VWIRE_BACKUP_M2S_42H_BACKUP_Msk  (0xFU << VBAT_VWIRE_BACKUP_M2S_42H_BACKUP_Pos)  /**< (VBAT_VWIRE_BACKUP) The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 42h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic. Mask */
#define VBAT_VWIRE_BACKUP_M2S_42H_BACKUP(value) (VBAT_VWIRE_BACKUP_M2S_42H_BACKUP_Msk & ((value) << VBAT_VWIRE_BACKUP_M2S_42H_BACKUP_Pos))
#define VBAT_VWIRE_BACKUP_Msk                 (0x000000FFUL)                                 /**< (VBAT_VWIRE_BACKUP) Register Mask  */

/** \brief VBAT register offsets definitions */
#define VBAT_PFR_STS_OFFSET          (0x00)         /**< (VBAT_PFR_STS) The Power-Fail and Reset Status Register collects and retains the VBAT RST and WDT event status when VCC1 is unpowered. Offset */
#define VBAT_CLOCK_EN_OFFSET         (0x08)         /**< (VBAT_CLOCK_EN) CLOCK ENABLE Offset */
#define VBAT_SYS_SHUTDOWN_OFFSET     (0x0C)         /**< (VBAT_SYS_SHUTDOWN) System Shutdown Enable register.\n Offset */
#define VBAT_MONOTONIC_COUNTER_OFFSET (0x20)         /**< (VBAT_MONOTONIC_COUNTER) MONOTONIC COUNTER Offset */
#define VBAT_COUNTER_HIWORD_OFFSET   (0x24)         /**< (VBAT_COUNTER_HIWORD) COUNTER HIWORD Offset */
#define VBAT_VWIRE_BACKUP_OFFSET     (0x28)         /**< (VBAT_VWIRE_BACKUP) VWIRE_BACKUP Offset */

/** \brief VBAT register API structure */
typedef struct
{  /* The VBAT Register Bank block is a block implemented for aggregating miscellaneous\n        battery-backed registers required the host and by the Embedded Controller (EC) Subsystem that are\n        not unique to a block implemented in the EC subsystem. */
  __IO  __VBAT_PFR_STS_bits_t          PFR_STS;       /**< Offset: 0x00 (R/W   8) The Power-Fail and Reset Status Register collects and retains the VBAT RST and WDT event status when VCC1 is unpowered. */
  __IO  __VBAT_CLOCK_EN_bits_t         CLOCK_EN;      /**< Offset: 0x08 (R/W  32) CLOCK ENABLE */
  __IO  __VBAT_SYS_SHUTDOWN_bits_t     SYS_SHUTDOWN;  /**< Offset: 0x0C (R/W  32) System Shutdown Enable register.\n */
  __IO  __VBAT_MONOTONIC_COUNTER_bits_t MONOTONIC_COUNTER; /**< Offset: 0x20 (R/W  32) MONOTONIC COUNTER */
  __IO  __VBAT_COUNTER_HIWORD_bits_t   COUNTER_HIWORD; /**< Offset: 0x24 (R/W  32) COUNTER HIWORD */
  __IO  __VBAT_VWIRE_BACKUP_bits_t     VWIRE_BACKUP;  /**< Offset: 0x28 (R/W  32) VWIRE_BACKUP */
} vbat_registers_t;
/** @}  end of The VBAT Register Bank block is a block implemented for aggregating miscellaneous\n        battery-backed registers required the host and by the Embedded Controller (EC) Subsystem that are\n        not unique to a block implemented in the EC subsystem. */

#endif /* _PIC32CX_0525SG12_VBAT_COMPONENT_H_ */
